app/controllers/currents_controller.rb

SELECT "currents".* FROM "currents"
---
  def index
    @currents = Current.all

SELECT "currents".* FROM "currents" WHERE "currents"."id" = ? LIMIT 1  [["id", "16"]]
---
  def show
    @current = Current.find(params[:id])

INSERT INTO "currents" ("code", "created_at", "currency", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["code", "91"], ["created_at", Mon, 21 Jan 2013 06:30:51 UTC +00:00], ["currency", "2"], ["name", "JCB"], ["updated_at", Mon, 21 Jan 2013 06:30:51 UTC +00:00]]
---
  def create
    @current = Current.new(params[:current])

    respond_to do |format|
      if @current.save

SELECT "currents".* FROM "currents" WHERE "currents"."id" = ? LIMIT 1  [["id", "14"]]
DELETE FROM "currents" WHERE "currents"."id" = ?  [["id", 14]]
---
  def destroy
    @current = Current.find(params[:id])
    @current.destroy