app/controllers/record_controller.rb

DELETE FROM "currents" WHERE "currents"."id" = ?  [["id", 1]]
INSERT INTO "currents" ("code", "created_at", "currency", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["code", 51], ["created_at", Thu, 17 Jan 2013 03:51:13 UTC +00:00], ["currency", 3], ["name", "クーポン１"], ["updated_at", Thu, 17 Jan 2013 03:51:13 UTC +00:00]]
---
	def post
		Current.transaction do
    	#currents = Current.destroy_all
    	currents = Current.destroy_all(['user_id = ?',current_user.id])

    	params[:currency].each do |currency|
    	@current = Current.new
  		p currency["Currency"]
  		@current.currency = currency["Currency"]
  		p currency["Code"]
  		@current.code = currency["Code"]
  		p currency["Name"]
  		@current.name = currency["Name"]
  		@current.user_id = current_user.id
  		@current.save!

SELECT "currents".* FROM "currents"
---
    def list
    	@currents = Current.all